Magicoe/LPC_LiteOS/platform/LPC5410x_Xpresso/chip_driver/fsl_clock.h
    kIRC12M_to_USART = MUX_A(CM_ASYNCAPA, 0) | MUX_B(CM_ASYNCAPB, 3),
    kWDT_OSC_to_USART = MUX_A(CM_ASYNCAPA, 1) | MUX_B(CM_ASYNCAPB, 3),
    kMAIN_CLK_OUT_to_USART = MUX_A(CM_ASYNCAPB, 0),
    kCLKIN_to_USART = MUX_A(CM_ASYNCAPB, 1),
    kSYS_PLL_OUT_to_USART = MUX_A(CM_ASYNCAPB, 2),

    kIRC12M_to_SPI = MUX_A(CM_ASYNCAPA, 0) | MUX_B(CM_ASYNCAPB, 3),
    kWDT_OSC_to_SPI = MUX_A(CM_ASYNCAPA, 1) | MUX_B(CM_ASYNCAPB, 3),
    kMAIN_CLK_OUT_to_SPI = MUX_A(CM_ASYNCAPB, 0),
    kCLKIN_to_SPI = MUX_A(CM_ASYNCAPB, 1),
    kSYS_PLL_OUT_to_SPI = MUX_A(CM_ASYNCAPB, 2),

    kIRC12M_to_I2C = MUX_A(CM_ASYNCAPA, 0) | MUX_B(CM_ASYNCAPB, 3),
    kWDT_OSC_to_I2C = MUX_A(CM_ASYNCAPA, 1) | MUX_B(CM_ASYNCAPB, 3),
    kMAIN_CLK_OUT_to_I2C = MUX_A(CM_ASYNCAPB, 0),
    kCLKIN_to_I2C = MUX_A(CM_ASYNCAPB, 1),
    kSYS_PLL_OUT_to_I2C = MUX_A(CM_ASYNCAPB, 2),

    kNONE_to_NONE = 0x80000000U,
} clock_attach_id_t;

/*  Clock dividers */
typedef enum _clock_div_name
{
    kCLOCK_DivSystickClk = 0,
    kCLOCK_DivAhbClk = 8,
    kCLOCK_DivAdcClk = 10,
    kCLOCK_DivClkOut = 11,
} clock_div_name_t;

/**
 * @brief FLASH Access time definitions
 */
typedef enum _clock_flashtim
{
    kCLOCK_Flash1Cycle = 0, /*!< Flash accesses use 1 CPU clock */
    kCLOCK_Flash2Cycle,     /*!< Flash accesses use 2 CPU clocks */
    kCLOCK_Flash3Cycle,     /*!< Flash accesses use 3 CPU clocks */
    kCLOCK_Flash4Cycle,     /*!< Flash accesses use 4 CPU clocks */
    kCLOCK_Flash5Cycle,     /*!< Flash accesses use 5 CPU clocks */
    kCLOCK_Flash6Cycle,     /*!< Flash accesses use 6 CPU clocks */
} clock_flashtim_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*! @brief  Set Asyc clock divider
 *  @param  divided_by_value  : Asyc clock divider
 */
static inline void Clock_SetAsyncClkDiv(uint32_t divided_by_value)
{
    ASYNC_SYSCON->ASYNCCLKDIV = divided_by_value; /* if divided_by_value is 0, clock will be disable*/
}

/*  @brief Enable the clock for specific IP.
 *  @param name  Which clock to enable, see clock_ip_name_t.
 */
static inline void CLOCK_EnableClock(clock_ip_name_t clk)
{
    uint32_t index = CLK_GATE_ABSTRACT_REG_OFFSET(clk);
    if (index < 2)
    {
        SYSCON->AHBCLKCTRLSET[index] = (1U << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
    }
    else
    {
        ASYNC_SYSCON->ASYNCAPBCLKCTRLSET = (1U << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
    }
}

/*  @brief Disable the clock for specific IP.
 *  @param name  Which clock to enable, see clock_ip_name_t.
 */
static inline void CLOCK_DisableClock(clock_ip_name_t clk)
{
    uint32_t index = CLK_GATE_ABSTRACT_REG_OFFSET(clk);
    if (index < 2)
    {
        SYSCON->AHBCLKCTRLCLR[index] = (1U << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
    }
    else
    {
        ASYNC_SYSCON->ASYNCAPBCLKCTRLCLR = (1U << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
    }
}

/*! @brief  Enables and disables PLL bypass mode
 *  @brief  bypass  : true to bypass PLL (PLL output = PLL input, false to disable bypass
 *  @return System PLL output clock rate
 */
static inline void CLOCK_SetBypassPLL(bool bypass)
{
    if (bypass)
    {
        SYSCON->SYSPLLCTRL |= (1UL << SYSCON_SYSPLLCTRL_BYPASS_SHIFT);
    }
    else
    {
        SYSCON->SYSPLLCTRL &= ~(1UL << SYSCON_SYSPLLCTRL_BYPASS_SHIFT);
    }
}

/*! @brief  Check if PLL is locked or not
 *  @return true if the PLL is locked, false if not locked
 */
static inline bool CLOCK_IsSystemPLLLocked(void)
{
    return (bool)((SYSCON->SYSPLLSTAT & SYSCON_SYSPLLSTAT_LOCK_MASK) != 0U);
}

/**
 * @brief   Set FLASH memory access time in clocks
 * @param   clks    : Clock cycles for FLASH access
 * @return  Nothing
 */
static inline void CLOCK_SetFLASHAccessCycles(clock_flashtim_t clks)
{
    uint32_t tmp;
    tmp = SYSCON->FLASHCFG & ~(SYSCON_FLASHCFG_FLASHTIM_MASK);
    /* Don't alter lower bits */
    SYSCON->FLASHCFG = tmp | ((uint32_t)clks << SYSCON_FLASHCFG_FLASHTIM_SHIFT);
}

/**
 * @brief	Configure the clock selection muxes.
 * @param	connection	: Clock to be configured.
 * @return	Nothing
 */
void CLOCK_AttachClk(clock_attach_id_t connection);

/**
 * @brief	Setup peripheral clock dividers.
 * @param	div_name	: Clock divider name
 * @param divided_by_value: Value to be divided
   @param reset, not used
 * @return	Nothing
 */
void CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divided_by_value, bool reset);

/**
 * @brief	Set the flash wait states for the input freuqency.
 * @param	iFreq	: Input frequency
 * @return	Nothing
 */
void CLOCK_SetFLASHAccessCyclesForFreq(uint32_t iFreq);

/*! @brief  Return Frequency of Core clock
 *  @return Frequency of Core clock
 */
uint32_t CLOCK_GetCoreClkFreq(void);

/*! @brief  Return Frequency of Bus clock
 *  @return Frequency of Bus clock
 */
uint32_t CLOCK_GetBusClkFreq(void);

/*! @brief	Return Frequency of selected clock
 *  @return	Frequency of selected clock
 */
uint32_t CLOCK_GetFreq(clock_name_t clockName);

/*! @brief	Return Frequency of External Clock
 *  @return	Frequency of External Clock. If no external clock is used returns 0.
 */
uint32_t CLOCK_GetExtClkFreq(void);

/*! @brief	Return Frequency of Watchdog Oscillator
 *  @return	Frequency of Watchdog Oscillator
 */
uint32_t CLOCK_GetWdtOscFreq(void);

/*! @brief	Return Frequency of PLL
 *  @return	Frequency of PLL
 */
uint32_t CLOCK_GetPllOutFreq(void);

/*! @brief	Return Frequency of 32kHz osc
 *  @return	Frequency of 32kHz osc
 */
uint32_t CLOCK_GetOsc32KFreq(void);

/*! @brief  Return Frequency of ADC
 *  @return Frequency of ADC
 */
uint32_t CLOCK_GetAdcClkFreq(void);

/*! @brief  Return Frequency of clock out
 *  @return Frequency of clock out
 */
uint32_t CLOCK_GetClockOutClkFreq(void);

/*! @brief  Return Frequency of IRC
 *  @return Frequency of IRC
 */
uint32_t CLOCK_GetIrc12MFreq(void);

/*! @brief  Return Frequency of PLL input
 *  @return Frequency of PLL input
 */
uint32_t CLOCK_GetPllInFreq(void);

/*! @brief	Return Frequency of Core System
 *  @return	Frequency of Core System
 */
uint32_t CLOCK_GetMainClkFreq(void);

/*! @brief	Return Frequency of Asynchronous APB Clock
 *  @return	Frequency of Asynchronous APB Clock Clock
 */
uint32_t CLOCK_GetAsyncApbClkFreq(void);

/*! @brief  Set Frequency of FRG
 *  @return status of the setting, true: setting successful, false: setting fail
 */
bool CLOCK_SetFRGClock(uint32_t freq);

